package com.algorithm.DynamicProgramming;
/**
 * @author xiehang
 * @date 2023/1/16 10:30
 * https://www.programmercarl.com/%E5%8A%A8%E6%80%81%E8%A7%84%E5%88%92%E7%90%86%E8%AE%BA%E5%9F%BA%E7%A1%80.html
 */
public class Template {

/*
    确定dp数组及下标的含义
    确定递推公式
    确定dp数组初始化
    确定遍历顺序
    举例推导dp数组
思考：
    如果想不清楚dp数组的具体含义，递归公式从何谈起，甚至初始化的时候就写错了。
    例如动态规划：不同路径还不够，要有障碍！ (opens new window)在这道题目中，初始化才是重头戏
    如果看过背包系列，特别是完全背包，那么两层for循环先后顺序绝对可以搞懵很多人，反而递归公式是简单的。
    至于推导dp数组的重要性，动规专题里几乎每篇Carl都反复强调，当程序结果不对的时候，一定要自己推导公式，看看和程序打印的日志是否一样。

如果想不清楚dp数组的具体含义，递归公式从何谈起，甚至初始化的时候就写错了。


    基础题目：
    背包问题：背包问题的理论基础重中之重是01背包，一定要理解透！

*/

}
